Well this is a fine kettle of fish:
```
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route.private_vpn_routes["10.128.0.0/24"] will be created
  + resource "aws_route" "private_vpn_routes" {
      + destination_cidr_block     = "10.128.248.0/21"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = "i-03d0d14056dafd1e7"
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = "rtb-022632c9ceaa6c55e"
      + state                      = (known after apply)
    }

  # aws_route.private_vpn_routes["10.128.1.0/24"] will be created
  + resource "aws_route" "private_vpn_routes" {
      + destination_cidr_block     = "10.128.248.0/21"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = "i-03d0d14056dafd1e7"
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = "rtb-0b451f1b5f6f43148"
      + state                      = (known after apply)
    }

  # aws_route.private_vpn_routes["10.128.2.0/24"] will be created
  + resource "aws_route" "private_vpn_routes" {
      + destination_cidr_block     = "10.128.248.0/21"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = "i-03d0d14056dafd1e7"
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = "rtb-08ff45c22c66f3bb6"
      + state                      = (known after apply)
    }

  # aws_route.public_vpn_route will be created
  + resource "aws_route" "public_vpn_route" {
      + destination_cidr_block     = "10.128.248.0/21"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = "i-03d0d14056dafd1e7"
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = "rtb-0fce54fa21948ed97"
      + state                      = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Do you want to perform these actions in workspace "production"?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_route.public_vpn_route: Creating...
aws_route.private_vpn_routes["10.128.2.0/24"]: Creating...
aws_route.private_vpn_routes["10.128.0.0/24"]: Creating...
aws_route.private_vpn_routes["10.128.1.0/24"]: Creating...

Error: Error creating route: InvalidParameterValue: This route table is used by a subnet, and doesn't support route destination which are more specific than VPC local CIDR.
        status code: 400, request id: 01e8b982-22d2-428d-8a82-d9848ffceb17

  on vpc_routes.tf line 7, in resource "aws_route" "public_vpn_route":
   7: resource "aws_route" "public_vpn_route" {



Error: Error creating route: InvalidParameterValue: This route table is used by a subnet, and doesn't support route destination which are more specific than VPC local CIDR.
        status code: 400, request id: ebfe18e2-e31b-41a2-955d-a7fd9d153e80

  on vpc_routes.tf line 14, in resource "aws_route" "private_vpn_routes":
  14: resource "aws_route" "private_vpn_routes" {



Error: Error creating route: InvalidParameterValue: This route table is used by a subnet, and doesn't support route destination which are more specific than VPC local CIDR.
        status code: 400, request id: 5bef45ec-e0b6-47b1-b3c8-0be8a1c1d677

  on vpc_routes.tf line 14, in resource "aws_route" "private_vpn_routes":
  14: resource "aws_route" "private_vpn_routes" {



Error: Error creating route: InvalidParameterValue: This route table is used by a subnet, and doesn't support route destination which are more specific than VPC local CIDR.
        status code: 400, request id: dbe8da81-5287-4fa9-a062-275602f20e34

  on vpc_routes.tf line 14, in resource "aws_route" "private_vpn_routes":
  14: resource "aws_route" "private_vpn_routes" {
```